Term4/discrete/lectures/6.org
#+LATEX_CLASS: general
#+TITLE: Лекция 6
#+AUTHOR: Ilya Yaroshevskiy


#+begin_export latex
\newcommand{\stirlF}[2]{\left[\begin{matrix} #1 \\ #2 \end{matrix}\right]}
\newcommand{\stirlS}[2]{\left\{\begin{matrix} #1 \\ #2 \end{matrix}\right\}}
\newcommand{\Set}{\text{Set}\,}
\newcommand{\Seq}{\text{Seq}\,}
\newcommand{\Cyc}{\text{Cyc}\,}
#+end_export


Рассмотрим деревья:
\[ T = t \times \Text{Seq}\,T \]
, где \(t\) --- корень
\[ A(t) = t\cdot \phi(A(t)) \]
\[ \phi(s) = \frac{1}{1 - s} \]
Решить это уравнение в общем виде можно с помощью формулы Лагранжа
#+ATTR_LATEX: :options [формула обращения Лагранжа]
#+begin_theorem org
\[ a_n = \frac{1}{n}\cdot[s^{n - 1}](\phi(s))^n \], где \([s^{n}]A(s)\) --- коэффицент при \(s^n\) в \(A(s)\)
\[ A(t) = \sum_{n = 0}^\infty a_n t^n \]
#+end_theorem
#+begin_examp org
Применим ее для деревьев
\[ a_n = \frac{1}{n}\cdot[s^{n - 1}]\left(\frac{1}{1 - s}\right)^n \]
\[ \left(\frac{1}{1 - s}\right)^n = (1 + s + s^2 + s^3 + \dots + s^k + \dots)^n \]
\[ (1 - s)^{-n} = 1 - \binom{-n}{1} s + \binom{-n}{2}s^2 - \binom{-n}{3}s^3 \]
\[ \binom{-n}{n - 1} = \frac{-n\cdot(-n - 1)\cdot(-n - 2)\cdot\dots\cdot(-n - (n - 1) + 1)}{1\cdot 2 \cdot 3 \cdot \dots \cdot (n - 1)} \]
\[ \frac{1}{n}(-1)^{n - 1}\binom{-n}{n - 1} = \frac{(2n - 2)!}{(n - 1)!n!} = \binom{2n - 2}{n - 1} \]
#+end_examp
#+begin_examp org
\[ \phi(s) = e^s \]
\[ \frac{a_n}{n!} = \frac{1}{n}\cdot[s^{n- 1}] e^{ns} \]
\[ e^{ns} = 1 + \frac{1}{1!}(ns) + \frac{1}{2!}(ns)^2 + \frac{1}{3!}(ns)^3 + \dots \]
\[ [s^{n - 1}]e^{ns} = \frac{n^{n - 1}}{(n - 1)!} \]
#+end_examp
* Производящая функция от нескольких перменных
\(\binom{n}{k}\) образуют таблицу:
| /                     | < |   |   |   |   |
| \(n\textbackslash k\) |   |   |   |   |   |
|-----------------------+---+---+---+---+---|
|                       | 1 |   |   |   |   |
|                       | 1 | 1 |   |   |   |
|                       | 1 | 2 | 1 |   |   |
|                       | 1 | 3 | 3 | 1 |   |
|                       | 1 | 4 | 6 | 4 | 1 |
\[ A_k(t) = \sum_{n = 0}^\infty \binom{n}{k}t^n \]
\[ B_n(t) = \sum_{n = 0}^\infty \binom{n}{l}t^k \]
\[ C(u ,z) = \sum_{n, k}\binom{n}{k}z^nu^k = \frac{1}{1 - z - uz}\]
Посмотрим на \(C(u, z)\) так: \(n\) --- вес, \(k\) --- стоимость. Будем считать, что \(z\) --- не берем объект, \(uz\) --- берем объект
\[ \text{Seq}\,\{z, uz\} = [], [z], [uz], [z, z], [z, uz], [uz, z], [uz, uz], \dots \]
\[ A(u, z) = z + uz \]
** Числа Стирлинга I рода
\fixme \\
Помеченные перстановки, \(\text{Set}\,\text{Cyc}\,Z\)
\[ \bigcup_{k = 0}^\infty \text{Set}_{=k}\text{Cyc}\, Z \]
\[ \text{Set}\,\text{Cyc}\,Z = e^{\ln\frac{1}{1 - Z}} = \frac{1}{1 - Z} \]
\[ \bigcup_{k = 0}^\infty \text{Set}_{= k}\left(u \times \text{Cyc}\,Z\right) \mapsto \sum_{n ,k}\stirlF{n}{k}\frac{1}{n!}z^nu^k\]
\[ \Set_{=k}(A) = \frac{\Seq_{=k}(A)}}{k!} = \frac{A(Z)^k}{k!}  \]
\[ u \times \Cyc Z = \sum_{n = 0}^\infty \frac{\left(u \ln \left(\frac{1}{1 - Z}\right)\right)^k}{k!} = e^{u\ln\frac{1}{1 - Z}} = (1 - Z)^{-u}\]
\[ (1 - Z)^{-u} = \sum_{n,k}\frac{\stirlF{n}{k}}{n!} Z^n u^k \]
** Числа Стирлинга II рода
\[ \stirlS{n}{k}\quad \Set\Set_{>0} Z \]
\[ \bigcup_{k = 0}^\infty\Set_{=k}(u\times \Set_{>0}Z) \]
\[ \sum_{k = 0}^\infty \frac{\left(u(e^Z - 1)^k\right)}{k!} = e^{ue^Z - u} = \sum_{n,k} \frac{\stirlS{n}{k}}{n!}z^nu^k\]
** Средняя стоимоть
- \(A\quad a_{n,k} = [z^nu^k]A(u, z)\) --- количество объектов веса \(n\) стоимости \(k\)
\[ w_n = \frac{\sum_{k = 0}^\infty k a_{n,k}}{\sum_{k = 0}^\infty a_{n, k}} = \frac{\left.[z^n]\left(\frac{\partial}{\partial u}A(u ,z)\right)\right|_{u = 1}}{[z^n]A(1, z)}\]
*** Разбиение на слагаемые, порядок важен
Аналогично рассотовке перегорожок, \(\Seq\Seq_{>0}Z\)
\[ \Seq \left(u\times\Seq_{>0}Z\right) \]
\[ \frac{1}{1 - z} - 1= \frac{z}{1 - z} \]
\[ A(u, z) =  \frac{1}{1 - \frac{uz}{1 - z}} = \frac{1 - z}{1 - z - uz} \]
\[ \frac{\partial A(u,z)}{\partial u}\bigg|_{u = 1} = \frac{z(1 - z)}{(1 - z- uz)^2} \bigg|_{u = 1} = \frac{z(1 - z)}{(1 - 2z)^2}\]
- Числитель ::
  \[ [z^n]\frac{z(1 - z)}{(1 - 2z)^2} = \frac{2^n(n + 1)}{4} \]
- Знаменатель ::
  \[ [z^n]\frac{1 - z}{1 - 2z} = 2^n - 2^{n - 1} = 2^{n - 1} \]
Среднее число слагаемых: \[ \frac{2^n(n + 1)}{2^{n - 1}\cdot4} = \frac{n + 1}{2} \]
*** Среднее число циклов в перестановке
\[ A(u ,z) = (1 - z)^{- u} \]
\[ \frac{\partial}{\partial u}A(u, z) = \frac{\partial}{\partial u} e^{u \ln\frac{1}{1 - z}} = \ln \frac{1}{1 - z}\cdot e^{u\ln\frac{1}{1 -z }} \]
Подставляем \(u = 1\):
- Числитель ::
  \[ [z^n]\frac{\ln \left(\frac{1}{1 - z}\right)}{1 - z} = B(z)\]
- Знаменатель ::
  \[ (1 - z)^{-u}\bigg_{u = 1} = \frac{1}{1 - z} \]
  \[ [z^n]\frac{1}{1 - z} = 1 \]
\[ (z + \frac{1}{2}z^2 + \frac{1}{3}z^3 + \dots + \frac{1}{k}z^k + \dots)\cdot(1 + z + z^2 + \dots) \]
\[ [z^n]B(z) = \sum_{k = 1}^n \frac{1}{k} = H_n \sim \log n \]


